//마우스 이벤트

//1) 선택한 요소 클릭했을 때 이벤트 발생

	click();

//2) 선택한 요소 더블클랙했을 때 이벤트 발생

	dbclick();
	
//3) 선택한 요소 마우스 영역에서 벗어났을 때 이벤트 발생
	
	mouseout();

//4) 선택한 영역에 마우스 올렸을 때 이벤트 발생
	
	mouseover();

//5) 마우스 올렸을 때와 벗어났을 때 각각 이벤트 발생
	
	hover();
	
//6) 마우스 눌렀을 때 이벤트 발생

	mousedown();
	
//7) 마우스 눌렀다가 뗐을 때 이벤트 발생
	
	mouseup();
	
//기타 이벤트
	
//8) 선택한 요소에서 키보드 눌렀을 때 이벤트 발생
// 시키는 두 가지 함수와 차이를 설명하세요.

	keypress();
	keydown();
/*	press는 누르고 있으면 계속 실행됨.
	down은 누르고 있어도 한번 실행되고 끝임.
*/
	
//9) 선택한 요소에서 키보드 뗐을 때 이벤트 발생
	keyup();